

class Vista:

    # def __init__(self):
    #     pass

    # self.nombre = 'Javier'
    # nombre2 = 'Javier'

    # vista =  Vista()

    # vista.nombre -> Javier
    # vista.nombre2 -> Error
    # vista.menuPrint() -> Llamar método


    def menuPrin(self): #Función que imprime la interfaz del menú principal en el código.  
        print(''' 
        ---------------------------------------------------------------------
        -                                                                   -
        -                                                                   -
        -       _                        __  __                             -
        -      | |     ___   __ _   ___ |  \/  |  __ _   _ __               -
        -      | |__  / _ \ / _` | / _ \| |\/| | / _` | | '_ \              -
        -      |____| \___/ \__, | \___/|_|  |_| \__,_| | .__/              -
        -                   |___/                       |_|                 -
        -                                                                   -
        -                                                                   -
        -                                                                   -
        -                                                                   -
        -                                                                   -
        -        ______________                      _________________      -
        -       |1. REGISTRARSE|                    |2. INICIAR SESIÓN|     -
        -        ¯¯¯¯¯¯¯¯¯¯¯¯¯¯                      ¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯      -
        -                            _________                              -
        -                           |3. SALIR |                             -
        -                            ¯¯¯¯¯¯¯¯¯                              -
        ---------------------------------------------------------------------
                    ᴹᵒᵈᵒ ᵈᵉˢᵃʳʳᵒˡˡᵃᵈᵒʳ ᶜᵒˡᵒᶜᵃⁿᵈᵒ ᵉˡ ᶜᵒ́ᵈᶦᵍᵒ "²¹²⁴⁰"
        -----------------------Bienvenido a TranzMap!------------------------    
        ''')





    def menuSec(self): #Función que imprime la interfaz del menú secundario en el código. 
        print(''' 
        ---------------------------------------------------------------------
        -                                                                   -
        -                                                                   -
        -       _                        __  __                             -
        -      | |     ___   __ _   ___ |  \/  |  __ _   _ __               -
        -      | |__  / _ \ / _` | / _ \| |\/| | / _` | | '_ \              -
        -      |____| \___/ \__, | \___/|_|  |_| \__,_| | .__/              -
        -                   |___/                       |_|                 -
        -                                                                   -
        -                                                                   -
        -                                                                   -
        -                                                                   -
        -                                                                   -
        -      ________________                          __________         -
        -     |1. CERRAR SESIÓN|                        |2. NAVEGAR|        -
        -      ¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯                          ¯¯¯¯¯¯¯¯¯¯         -
        -                           _____________                           -
        -                          |3. UBICACIÓN |                          -
        -                           ¯¯¯¯¯¯¯¯¯¯¯¯¯                           -
        ---------------------------------------------------------------------
    
        ''')

 